AUTHOR_NAME = "Халлимова Гульназ Зинуровна"
ABOUT_TEXT = (
    "🧑‍⚕️ *Я - интегративный, превентивный терапевт, кардиолог, нутрициолог.*\n\n"
    
    "🔍 *Что значит интегративный?*\n"
    "• Специалист, который рассматривает здоровье пациента целостно. Не лечит отдельный орган.\n"
    "• Сочетает в лечении как принципы классической, так и альтернативной медицины.\n\n"
    
    "🎯 *Что значит превентивный?*\n"
    "• Специалист, деятельность которого направлена на профилактику, предупреждение заболеваний и сохранение активного долголетия.\n\n"
    "*Например:* Вы обратились ко мне, потому что в семье много инфарктов.\n"
    "Мы изучим анализы, жалобы, при необходимости, генетические тесты.\n"
    "Постепенно подберем схему поддержки организма, чтобы отрицательная генетика проявила себя не в 40 лет, а где-то в 140)\n\n"
    
    "📌 *Я доктор. Я не иллюзионист.* Наследственные заболевания все равно придут. *Важно добиться активного долголетия.*\n\n"
    
    "📋 *Какие вопросы я рассматриваю:*\n"
    "• Высокий холестерин\n"
    "• Высокий гомоцистеин\n"
    "• «Плохие анализы»\n"
    "• Атеросклероз (бляшки) в сосудах\n"
    "• Боль в груди, одышка\n"
    "• Отеки\n"
    "• Аритмия, частый пульс, замедление пульса\n"
    "• Боли в мышцах, теле\n"
    "• Вопросы головокружения и обмороков\n"
    "• Сердечная недостаточность\n"
    "• Уже сделаны коронарное шунтирование и стентирование\n"
    "• Выставлена стенокардия\n"
    "• Были инфаркты\n"
    "• Повышается или снижается артериальное давление\n"
    "• Много заболеваний сердца и сосудов в семье\n"
    "• Боюсь сердечных болезней - как максимально предупредить?\n"
    "• Дефициты железа и т.д.\n"
    "• Слабость, нет сил\n"
    "• *И много другое*\n\n"
    
    "🛣 *Мой профессиональный путь:*\n"
    "🔺 2009 год - с отличием окончила лечебный факультет Казанского Медицинского Государственного Университета.\n"
    "🔺 2009-2010 гг. - интернатура по специальности терапия.\n"
    "🔺 2010 г. - профессиональная переподготовка по специальности кардиология.\n"
    "🔺 2010 - 2017 гг. - врач-кардиолог отделения кардиологии Межрегионального клинико-диагностического центра, г.Казань.\n"
    "🔺 2017-2020 гг. - врач-кардиолог, терапевт медцентра Кардио Центр, г.Казань.\n"
    "🔺 С 2016 г. повышение квалификации по вопросам питания при различных заболеваниях и с целью снижения веса.\n"
    "🔺 2018 - 2020 гг. студентка международного института антивозрастной и превентивной медицины Prevent Age.\n"
    "🔺 С 2020 г. по настоящее время - врач терапевт, кардиолог, нутрициолог в медицинском центре Продлить Жизнь, Казань.\n\n"
    
    "📞 *Телефон для записи:* 216-06-00\n\n"
    
    "✨ *В чем мои плюсы:*\n"
    "• Начинала работу в центре высоких технологий - вела пациентов до и после стентирования коронарных артерий, после шунтирования, до и после коронарографии, подбирала таблетки при болезнях сердца и сосудов, при гипертонии. *Я знаю, как бывает, если не начать заранее.*\n"
    "• Сочетания с сахарным диабетом, проблемами суставов, щитовидной железы и ЖКТ тоже наблюдала, только тогда туннельно размышляла. Теперь вижу всю картину.\n"
    "• Обучилась вопросам здорового питания от курсов до института PreventAge.\n"
    "• Обучилась в PreventAge - а это мощные знания в превентивной медицине.\n"
    "• Знаю, понимаю связь питание-добавки-препараты\n"
    "• Не осуждаю пациентов за БАДы, просто пытаюсь подсказать хорошие\n"
    "• Автор и ведущая онлайн проекта Здоровое тело. На практике знаю о важности соблюдения базовых правил (питание, движение, сон) для здоровья и благополучия."
)

REVIEWS_LINKS = [
    "https://prodoctorov.ru/kazan/vrach/156539-halimova/otzivi/#otzivi",
    "https://doctu.ru/kazan/doctor/khalimova-g-z",
    "https://t.me/gulnaz_halimova"
]

PRODUCT_TEXT = (
    "🌿 *Проект «Здоровое Тело»*\n\n"
    "Здоровое Тело — это программа сопровождения по питанию и образу жизни с понятными инфо-блоками и поддержкой врача в уютной, немноголюдной женской группе.\n\n"
    "🔍 *С какими запросами приходят:*\n"
    "✔️ Постройнеть\n"
    "✔️ Уменьшить отёчность\n"
    "✔️ Почувствовать больше энергии\n"
    "✔️ Разобраться с питанием и выстроить рацион с учётом индивидуальных особенностей\n"
    "✔️ Найти слабые звенья образа жизни и постепенно укрепить их\n\n"
    "🩺 *Если вы мой пациент* — проект особенно полезен: я корректирую «тарелки», учитывая вашу медицинскую историю.\n\n"
    "❗ *«Здоровое Тело» — не похудательный марафон.*\n"
    "В программе:\n"
    "— нет готовых рационов и жёстких меню\n"
    "— нет подсчёта калорий\n"
    "— нет универсальных схем\n\n"
    "🎯 *Главная цель* — научить вас самостоятельно составлять «свой» рацион, который работает именно для вас.\n\n"
    "📚 *Что входит:*\n"
    "✔️ Моё сопровождение в группе диалогов\n"
    " — контроль дневников питания\n"
    " — обратная связь\n"
    " — ответы на вопросы\n"
    "✔️ Анализ первичного опросника и индивидуальные рекомендации\n"
    "✔️ Информационные блоки:\n"
    " — питание, образ жизни, формирование тарелки, сочетание продуктов и др.\n"
    "✔️ Отдельная группа с примерными рецептами и допустимыми сочетаниями\n\n"
    "📌 *При продолжении:*\n"
    "— со 2 месяца: блоки «желчь», «лимфа», «тяга к сладкому», «кишечник»\n"
    "— с 3 месяца (по желанию): блок о холестерине\n\n"
    "📎 *Доступ к инфо-блокам сохраняется 1 год после завершения.*\n\n"
    "⸻\n\n"
    "👩‍🦰 *Формат участия*\n"
    "На сопровождение в группу принимаю *только женщин* ❤️\n\n"
    "⬇️ *Выберите подходящий вариант:*"
)

BOOKING_INFO = (
    "📍 Приём ведётся по адресам:\n"
    "• Медецинский центр «Продли жизнь», Республика Татарстан (Татарстан), Казань, улица Достоевского, 52\n"
    "📞 Запись: +7 (843) 216-06-00 \n"
    "👨‍⚕️ Онлайн запись https://prodlizhizn.ru/halimova-gulnaz-zinnurovna/ "

)

CONSENT_TEXT = (
    "Нажимая кнопку ниже, вы даёте согласие на обработку персональных данных в соответствии с "
    "ФЗ-152 «О персональных данных». Ваши данные (ФИО, телефон, email) будут использованы "
    "исключительно для  рассылки вам всей необходимой информации, связи, с вами и записи на консультацию."
)

WELCOME_MESSAGE = f"""
👋 Добро пожаловать в бот {AUTHOR_NAME}!

Здесь вы можете:
• Узнать обо мне и моём опыте
• Посмотреть отзывы пациентов
• Узнать о моих программах
• Записаться на консультацию
• Получить полезные материалы

Выберите нужный раздел:"""

MENU_MESSAGE = "📋 Главное меню:"
BACK_BUTTON_TEXT = "⬅️ Назад в меню"
CHANNEL_ID = "@dr_halimova_gulnaz"  # Канал для проверки подписки
DATA_DIR = "./data"  # Папка с гайдами
ALLOWED_EXTENSIONS = ['.pdf', '.txt', '.doc', '.docx', '.jpg', '.jpeg', '.png']