# config.py
AUTHOR_NAME = "Халлимова Гульназ Зинуровна"
ABOUT_TEXT = (
    "👨‍⚕️ https://vkvideo.ru/video-211359932_456239126?t=16s&ref_domain=prodlizhizn.ru "
)

REVIEWS_LINKS = [
    "https://prodoctorov.ru/kazan/vrach/156539-halimova/otzivi/#otzivi",
    "https://doctu.ru/kazan/doctor/khalimova-g-z"
]

PRODUCT_TEXT = (
    "📘 Проект «Здоровое Тело»\n"
    "https://t.me/dr_halimova_gulnaz/1815?single"
)

BOOKING_INFO = (
    "📍 Приём ведётся по адресам:\n"
    "• Медецинский центр «Продли жизнь», Республика Татарстан (Татарстан), Казань, улица Достоевского, 52\n"
    "📞 Запись: +7 (843) 216-06-00 \n"
    "👨‍⚕️ Онлайн запись https://prodlizhizn.ru/halimova-gulnaz-zinnurovna/ "

)
CONSENT_TEXT = (
    "Нажимая кнопку ниже, вы даёте согласие на обработку персональных данных в соответствии с "
    "ФЗ-152 «О персональных данных». Ваши данные (ФИО, телефон, email) будут использованы "
    "исключительно для связи с вами и записи на консультацию."
)

WELCOME_MESSAGE = f"""
👋 Добро пожаловать в бот {AUTHOR_NAME}!

Здесь вы можете:
• Узнать обо мне и моём опыте
• Посмотреть отзывы пациентов
• Узнать о моих программах
• Записаться на консультацию
• Получить полезные материалы

Выберите нужный раздел:"""

MENU_MESSAGE = "📋 Главное меню:"
BACK_BUTTON_TEXT = "⬅️ Назад в меню"